## CSPB 3287 - FALL 2023  Final Project - Expense Tracker Database System

Name: Shibo Chen

Email: shch9617@colorado.edu

### Connect to the CSPB MySQL Database

In [23]:
import os
import configparser

mycfg = configparser.ConfigParser()
mycfg.read("../mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")
database = mycfg['mysql']['url'].split('@')[1]
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url

User    : [shch9617]
Database: [[mysql://shch9617...@applied-sql.cs.colorado.edu:3306/shch9617]

### Load the SQL magic and Get the MySQL version number to verify we are connected

In [24]:
%reload_ext sql
print ("get version...")
%sql SELECT version()

get version...
 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
1 rows affected.

[('8.0.33',)]

### Database Design

### Create User, Category, Transaction, Income and Expense Tables respectively

In [25]:
%%sql

DROP TABLE if exists Income;
DROP TABLE if exists Expense;
DROP TABLE if exists Transaction;
DROP TABLE if exists Category;
DROP TABLE if exists User;


## User Table
CREATE TABLE User (
    userID INT AUTO_INCREMENT PRIMARY KEY,
    username VARCHAR(50) NOT NULL,
    email VARCHAR(60) NOT NULL,
    password VARCHAR(50) NOT NULL
);

## Category Table
CREATE TABLE Category (
    categoryID INT PRIMARY KEY,
    name VARCHAR(60) NOT NULL
);

## Transaction Table
CREATE TABLE Transaction (
    transactionID INT AUTO_INCREMENT PRIMARY KEY,
    userID INT,
    categoryID INT,
    incomeID VARCHAR(255),
    expenseID VARCHAR(255),
    amount DECIMAL(10, 2) NOT NULL,
    description VARCHAR(255),
    date DATE,
    FOREIGN KEY (userID) REFERENCES User(userID) ON DELETE CASCADE,
    FOREIGN KEY (categoryID) REFERENCES Category(categoryID)
);

## Income Table
CREATE TABLE Income (
    incomeID VARCHAR(255) PRIMARY KEY,
    userID INT,
    categoryID INT,
    transactionID INT,
    amount DECIMAL(10, 2) NOT NULL,
    description VARCHAR(255),
    date DATE,
    FOREIGN KEY (userID) REFERENCES User(userID) ON DELETE CASCADE,
    FOREIGN KEY (categoryID) REFERENCES Category(categoryID),
    FOREIGN KEY (transactionID) REFERENCES Transaction(transactionID)
);

## Expense Table
CREATE TABLE Expense (
    expenseID VARCHAR(255) PRIMARY KEY,
    userID INT,
    categoryID INT,
    transactionID INT,
    amount DECIMAL(10, 2) NOT NULL,
    description VARCHAR(255),
    date DATE,
    FOREIGN KEY (userID) REFERENCES User(userID) ON DELETE CASCADE,
    FOREIGN KEY (categoryID) REFERENCES Category(categoryID),
    FOREIGN KEY (transactionID) REFERENCES Transaction(transactionID)
);

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [26]:
%sql SHOW TABLES

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
5 rows affected.

[('Category',), ('Expense',), ('Income',), ('Transaction',), ('User',)]

### Insert some sample data into the corresponding tables

In [27]:
%%sql

## Inserting data into User Table
INSERT INTO User (userID, username, email, password)
VALUES
    (1, 'john_doe', 'john@example.com', 'password123'),
    (2, 'jane_smith', 'jane@example.com', 'securepass');

## Inserting data into Category Table
INSERT INTO Category (categoryID, name)
VALUES
    (1, 'Salary'),
    (2, 'Food & drink'),
    (3, 'Bills'),
    (4, 'Services'),
    (5, 'Entertainment'),
    (6, 'Shopping'),
    (7, 'Travel'),
    (8, 'Others');
    

## Inserting data into Transaction Table
INSERT INTO Transaction (transactionID, userID, categoryID, incomeID, expenseID, amount, description, date)
VALUES
    (1, 1, 1, '1', NULL, 2500.00, 'Salary', '2023-01-15'),
    (2, 2, 2, NULL, '1', -150.00, 'Food & drink', '2023-01-16'),
    (3, 1, 4, '2', NULL, 300.00, 'Services', '2023-01-17'),
    (4, 2, 7, NULL, '2', -400.00, 'Travel', '2023-01-18');

## Inserting data into Income Table
INSERT INTO Income (incomeID, userID, categoryID, transactionID, amount, description, date)
VALUES
    ('1', 1, 1, 1, 2500.00, 'Salary', '2023-01-15'),
    ('2', 1, 4, 3, 300.00, 'Services', '2023-01-17');

## Inserting data into Expense Table
INSERT INTO Expense (expenseID, userID, categoryID, transactionID, amount, description, date)
VALUES
    ('1', 2, 2, 2, -150.00, 'Food & drink', '2023-01-16'),
    ('2', 2, 7, 4, -400.00, 'Travel', '2023-01-18');

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
2 rows affected.
8 rows affected.
4 rows affected.
2 rows affected.
2 rows affected.

[]

In [28]:
%sql SELECT * FROM User;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
2 rows affected.

[(1, 'john_doe', 'john@example.com', 'password123'),
 (2, 'jane_smith', 'jane@example.com', 'securepass')]

In [29]:
%sql SELECT * FROM Transaction;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
4 rows affected.

[(1, 1, 1, '1', None, Decimal('2500.00'), 'Salary', datetime.date(2023, 1, 15)),
 (2, 2, 2, None, '1', Decimal('-150.00'), 'Food & drink', datetime.date(2023, 1, 16)),
 (3, 1, 4, '2', None, Decimal('300.00'), 'Services', datetime.date(2023, 1, 17)),
 (4, 2, 7, None, '2', Decimal('-400.00'), 'Travel', datetime.date(2023, 1, 18))]

### Triggers

***1-Create triggers in database that automatically insert records into the Income and Expense tables based on the sign of the amount in the Transaction table. Below are the triggers for positive and negative amounts:***

In [30]:
%%sql

## Trigger for positive amounts (Income)
CREATE TRIGGER tr_insert_income
AFTER INSERT ON Transaction
FOR EACH ROW
BEGIN
    IF NEW.amount > 0 THEN
        INSERT INTO Income (incomeID, userID, categoryID, transactionID, amount, description, date)
        VALUES (NEW.incomeID, NEW.userID, NEW.categoryID, NEW.transactionID, NEW.amount, NEW.description, NEW.date);
    END IF;
END;

## Trigger for negative amounts (Expense)
CREATE TRIGGER tr_insert_expense
AFTER INSERT ON Transaction
FOR EACH ROW
BEGIN
    IF NEW.amount < 0 THEN
        INSERT INTO Expense (expenseID, userID, categoryID, transactionID, amount, description, date)
        VALUES (NEW.expenseID, NEW.userID, NEW.categoryID, NEW.transactionID, NEW.amount, NEW.description, NEW.date);
    END IF;
END;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
0 rows affected.
0 rows affected.

[]

Create Test Case to verify the above triggers are working properly

In [31]:
%%sql
INSERT INTO Transaction (transactionID, userID, categoryID, incomeID, expenseID, amount, description, date)
VALUES (5, 1, 5, NULL, 3, -800.00, 'Entertainment', '2023-01-20');

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
1 rows affected.

[]

In [32]:
%sql SELECT * FROM Transaction;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
5 rows affected.

[(1, 1, 1, '1', None, Decimal('2500.00'), 'Salary', datetime.date(2023, 1, 15)),
 (2, 2, 2, None, '1', Decimal('-150.00'), 'Food & drink', datetime.date(2023, 1, 16)),
 (3, 1, 4, '2', None, Decimal('300.00'), 'Services', datetime.date(2023, 1, 17)),
 (4, 2, 7, None, '2', Decimal('-400.00'), 'Travel', datetime.date(2023, 1, 18)),
 (5, 1, 5, None, '3', Decimal('-800.00'), 'Entertainment', datetime.date(2023, 1, 20))]

***2-Triggers to Automatically Delete Corresponding Records:***

To automatically delete corresponding records from the Transactions table when a record is deleted from either Income or Expense, you can use triggers like this.

In [33]:
%%sql

CREATE TRIGGER delete_income_transaction
AFTER DELETE
ON Income
FOR EACH ROW
BEGIN
  DELETE FROM Transaction WHERE transactionID = OLD.transactionID;
END;

CREATE TRIGGER delete_expense_transaction
AFTER DELETE
ON Expense
FOR EACH ROW
BEGIN
  DELETE FROM Transaction WHERE transactionID = OLD.transactionID;
END;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
0 rows affected.
0 rows affected.

[]

Use **DELETE** Statement to remove a transaction from Transaction Table to verify the trigger is working properly

In [34]:
%%sql
DELETE FROM Expense WHERE transactionID = 2

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
1 rows affected.

[]

***3-Handling User Deletion and Associated Data:***
    
When a user is deleted, you can use cascading foreign key constraints to automatically delete associated records from other tables. For example, if you have foreign keys with the ON DELETE CASCADE option, deleting a user will delete their transactions, income, and expense records.

In [35]:
%%sql 
ALTER TABLE Transaction
ADD CONSTRAINT fk_user_transaction
FOREIGN KEY (userID)
REFERENCES User(userID)
ON DELETE CASCADE;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
4 rows affected.

[]

In [36]:
%sql DELETE FROM User WHERE userID = 2

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
1 rows affected.

[]

***4-update the amount in the Transaction table when a corresponding entry in either the Income or Expense table is updated***

In [37]:
%%sql

## Create a trigger for updating the Transaction table when an Income is updated
CREATE TRIGGER update_transaction_after_income_update
AFTER UPDATE ON Income
FOR EACH ROW
BEGIN
    UPDATE Transaction
    SET amount = NEW.amount
    WHERE transactionID = NEW.transactionID;
END;


## Create a trigger for updating the Transaction table when an Expense is updated

CREATE TRIGGER update_transaction_after_expense_update
AFTER UPDATE ON Expense
FOR EACH ROW
BEGIN
    UPDATE Transaction
    SET amount = NEW.amount
    WHERE transactionID = NEW.transactionID;
END;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
0 rows affected.
0 rows affected.

[]

Create a test case to validate that the amount in the Transaction table is successfully updated when modifying the amount in the Expense table.

In [38]:
%%sql
UPDATE Expense
SET amount = -1000  
WHERE expenseID = 3;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
1 rows affected.

[]

In [39]:
%sql SELECT * FROM Transaction;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
3 rows affected.

[(1, 1, 1, '1', None, Decimal('2500.00'), 'Salary', datetime.date(2023, 1, 15)),
 (3, 1, 4, '2', None, Decimal('300.00'), 'Services', datetime.date(2023, 1, 17)),
 (5, 1, 5, None, '3', Decimal('-1000.00'), 'Entertainment', datetime.date(2023, 1, 20))]

## Data Combination and Aggregation:

***1-Calculating Total Income, Total Expenses, and Net Income:***

In [40]:
%%sql
SELECT
  userID,
  SUM(CASE WHEN amount >= 0 THEN amount ELSE 0 END) AS total_income,
  SUM(CASE WHEN amount < 0 THEN amount ELSE 0 END) AS total_expenses,
  SUM(amount) AS net_income
FROM
  Transaction
WHERE
  userID = 1 
GROUP BY
  userID;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
1 rows affected.

[(1, Decimal('2800.00'), Decimal('-1000.00'), Decimal('1800.00'))]

***2-Using SQL JOIN AND GROUP BY Operations***:
    
use SQL JOIN AND GROUP BY operations to combine data from the User, Transaction, and Category tables to get the total expenses for each category:

In [41]:
%%sql

SELECT
    u.userID,
    u.username,
    c.name AS category_name,
    SUM(t.amount) AS total_expense
FROM
    User u
JOIN
    Transaction t ON u.userID = t.userID
JOIN
    Category c ON t.categoryID = c.categoryID
WHERE
    t.expenseID IS NOT NULL
GROUP BY
    u.userID, u.username, c.name;

 * mysql://shch9617:***@applied-sql.cs.colorado.edu:3306/shch9617
1 rows affected.

[(1, 'john_doe', 'Entertainment', Decimal('-1000.00'))]